DR_EXPLAIN.namespace( 'DR_EXPLAIN.data_index' );
DR_EXPLAIN.data_index = {

	// index
	DREX_NODE_KEYWORDS: [2,4,5,1,2,3,10,11,19,2,5,4,2,16,4,7,2,1,1,20,21,2,7,2,8,2,9,12,3,6,13,14,15,16,17,18],
	DREX_NODE_KEYWORDS_START: [0,0,0,0,3,5,5,8,8,8,9,9,9,9,9,12,16,18,20,21,23,25,27,29,30,31,33,34,35,36,36,36,36,36,36,36], //length:= drex.nodes_count,
	DREX_NODE_KEYWORDS_END: [0,0,0,3,5,5,8,8,8,9,9,9,9,9,12,16,18,20,21,23,25,27,29,30,31,33,34,35,36,36,36,36,36,36,36,36], //length:= drex.nodes_count,

	DREX_KEYWORD_NAMES: ["<НОВОЕ КЛЮЧЕВОЕ СЛОВО>","соединение с источником","набор данных","файловая система","репозиторий объектов","группировка объектов","конфигурация","копирование данных","запись данных","чтение данных","копирование файлов","удаление файлов","обработка файлов","логирование","опции","профилирование","многопоточная работа","шаблоны","юнит тесты","примеры","запросы","инкрементальные точки"],
	DREX_KEYWORD_CHILD_START: [1,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22],
	DREX_KEYWORD_CHILD_END: [22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22,22]
	
};